package com.junyufr.iservice.enums;

/**
 * @ClassName SubCodeEnum
 * @Description 此枚举包含2.0项目中所有对外返回code，开发人员在往数据库中新增返回code时，建议也跟新此枚举类
 * @Author luzhiyu
 * @Date 2019/6/12 14:32
 * @Version 1.0
 */
public enum SubCodeEnum {

    /**
     * 成功的二级返回码
     */
    SUCCESS_VERIFY("10", "验证成功", "0"),
    SUCCESS_SAME_PERSON("11", "系统判断为同一人", "0"),
    SUCCESS_HIT("12", "命中", "0"),
    SUCCESS_ANALYSIS("13", "解析成功", "0"),
    SUCCESS_HAVE_DATA("14", "查询有数据", "0"),
    SUCCESS_QUERY("15", "查询成功", "0"),
    SUCCESS_CONFIRM("16", "一致", "0"),
    SUCCESS_SUCCESS("17", "成功", "0"),
    SUCCESS_CERT("18", "证书签发成功", "0"),

    /**
     * 业务失败的二级返回码
     */
    BIZ_FAIL_1001("-1001", "未命中", "-100"),
    BIZ_FAIL_1002("-1002", "信息验证不通过", "-100"),
    BIZ_FAIL_1003("-1003", "库中无记录", "-100"),
    BIZ_FAIL_1004("-1004", "上个月已离网", "-100"),
    BIZ_FAIL_1005("-1005", "不支持此号码", "-100"),
    BIZ_FAIL_1006("-1006", "查无结果", "-100"),
    BIZ_FAIL_1007("-1007", "系统不能确定是否为同一人", "-100"),
    BIZ_FAIL_1008("-1008", "系统判定为不同人", "-100"),
    BIZ_FAIL_1009("-1009", "防假体模型未通过", "-100"),
    BIZ_FAIL_1010("-1010", "库中无此人", "-100"),
    BIZ_FAIL_1011("-1011", "姓名与身份证号不匹配", "-100"),
    BIZ_FAIL_1012("-1012", "库中无照片", "-100"),
    BIZ_FAIL_1013("-1013", "上传照，检测人脸失败", "-100"),
    BIZ_FAIL_1014("-1014", "上传照，检测到多张人脸", "-100"),
    BIZ_FAIL_1015("-1015", "库里证件照，检测人脸失败", "-100"),
    BIZ_FAIL_1016("-1016", "库里证件照，检测到多张人脸", "-100"),
    BIZ_FAIL_1017("-1017", "返回信息解析异常", "-100"),
    BIZ_FAIL_1018("-1018", "信息不匹配", "-100"),
    BIZ_FAIL_1019("-1019", "右侧照片，检测人脸失败", "-100"),
    BIZ_FAIL_1020("-1020", "右侧照片，检测到多张人脸", "-100"),
    BIZ_FAIL_1021("-1021", "左侧照片，检测人脸失败", "-100"),
    BIZ_FAIL_1022("-1022", "左侧照片，检测到多张人脸", "-100"),
    BIZ_FAIL_1023("-1023", "检测到多张人脸", "-100"),
    BIZ_FAIL_1024("-1024", "判定为假体攻击", "-100"),
    BIZ_FAIL_1025("-1025", "判断为中途换人", "-100"),
    BIZ_FAIL_1026("-1026", "未检测到人脸", "-100"),
    BIZ_FAIL_1027("-1027", "解析失败", "-100"),
    BIZ_FAIL_1028("-1028", "库里证件照，照片格式不正确", "-100"),
    BIZ_FAIL_1029("-1029", "库里证件照，照片文件太大", "-100"),
    BIZ_FAIL_1030("-1030", "查询无数据", "-100"),
    BIZ_FAIL_1031("-1031", "不一致", "-100"),
    BIZ_FAIL_1032("-1032", "无法认证", "-100"),
    BIZ_FAIL_1033("-1033", "自由职业者", "-100"),
    BIZ_FAIL_1034("-1034", "传入骏聿流水号有误，请检查", "-100"),
    BIZ_FAIL_1035("-1035", "文件生成中，请稍后再试", "-100"),
    BIZ_FAIL_1036("-1036", "文件下载次数超过限制", "-100"),
    BIZ_FAIL_1037("-1037", "请确认本人操作", "-100"),
    BIZ_FAIL_1038("-1038", "用户已携号转网", "-100"),
    BIZ_FAIL_1039("-1039", "库里证件照，照片不合格", "-100"),
    BIZ_FAIL_1040("-1040", "企业名称不匹配", "-100"),
    BIZ_FAIL_1041("-1041", "身份证号码不匹配", "-100"),
    BIZ_FAIL_1042("-1042", "姓名不匹配", "-100"),
    BIZ_FAIL_1043("-1043", "工商注册号不匹配", "-100"),
    BIZ_FAIL_1044("-1044", "自拍照检测不到人脸", "-100"),
    BIZ_FAIL_1045("-1045", "抓拍照检测不到人脸", "-100"),
    BIZ_FAIL_1046("-1046", "自拍照检测到多张人脸", "-100"),
    BIZ_FAIL_1047("-1047", "抓拍照检测到多张人脸", "-100"),
    BIZ_FAIL_1050("-1050", "再次获取签发证书失败，请线下提交工单", "-100"),
    BIZ_FAIL_1051("-1051", "未查询到证书签发记录，请线下提交工单", "-100"),
    BIZ_FAIL_1052("-1052", "未查询到交易记录，请线下提交工单", "-100"),
    BIZ_FAIL_1053("-1053", "授权码与交易流水号不匹配，请线下提交工单", "-100"),
    BIZ_FAIL_1054("-1054", "用户上传文件已过期，请线下提交工单", "-100"),
    BIZ_FAIL_1055("-1055", "交易记录查询已过期，请线下提交工单", "-100"),
    BIZ_FAIL_1056("-1056", "视频活体方案未配置，请线下提交工单", "-100"),

    PARAM_NULL_2000("-2000", "必录项缺失", "-200"),
    PARAM_NULL_2001("-2001", "必录项缺失,姓名不能为空", "-200"),
    PARAM_NULL_2002("-2002", "必录项缺失,身份证号不能为空", "-200"),
    PARAM_NULL_2003("-2003", "必录项缺失,照片不能为空", "-200"),
    PARAM_NULL_2004("-2004", "必录项缺失,手机号不能为空", "-200"),
    PARAM_NULL_2005("-2005", "必录项缺失,授权信息不能为空", "-200"),
    PARAM_NULL_2006("-2006", "必录项缺失,加密信息不能为空", "-200"),
    PARAM_NULL_2007("-2007", "必录项缺失,数据包不能为空", "-200"),
    PARAM_NULL_2008("-2008", "必录项缺失,银行卡号不能为空", "-200"),
    PARAM_NULL_2010("-2010", "必录项缺失,企业统一社会信用代码为空", "-200"),
    PARAM_NULL_2013("-2013", "右侧照片，必录项缺失，照片不能为空", "-200"),
    PARAM_NULL_2014("-2014", "左侧照片，必录项缺失，照片不能为空", "-200"),
    PARAM_NULL_2015("-2015", "视频不能为空", "-200"),
    PARAM_NULL_2016("-2016", "必录项缺失，缺失具体参数名", "-200"),
    PARAM_NULL_2017("-2017", "必录项缺失，时间戳不能为空", "-200"),
    PARAM_NULL_2018("-2018", "必录项缺失，车牌号不能为空", "-200"),
    PARAM_NULL_2019("-2019", "证书申请受理失败，必录项缺失，授权签名不能为空", "-200"),
    PARAM_NULL_2020("-2020", "证书申请受理失败，必录项缺失，业务场景不能为空", "-200"),
    PARAM_NULL_2021("-2021", "证书申请受理失败，必录项缺失，协议授权版本号不能为空", "-200"),
    PARAM_NULL_2022("-2022", "证书申请受理失败，必录项缺失，协议签约流水号不能为空", "-200"),
    PARAM_NULL_2023("-2023", "证书申请受理失败，必录项缺失，查询类型不能为空", "-200"),
    PARAM_NULL_2024("-2024", "必录项缺失,回调url不能为空", "-200"),
    PARAM_NULL_2025("-2025", "必录项缺失,result_type不能为空", "-200"),
    PARAM_NULL_2026("-2026", "回调url格式不正确，请以http://或https://开头", "-200"),
    PARAM_NULL_2027("-2027","回调url格式不正确，请以/开头","-200"),

    PARAM_WRONG_3001("-3001", "姓名格式不正确", "-300"),
    PARAM_WRONG_3002("-3002", "身份证号码格式不正确", "-300"),
    PARAM_WRONG_3003("-3003", "数据格式不正确", "-300"),
    PARAM_WRONG_3004("-3004", "时间格式不正确", "-300"),
    PARAM_WRONG_3005("-3005", "手机号码格式不正确", "-300"),
    PARAM_WRONG_3006("-3006", "照片不合格", "-300"),
    PARAM_WRONG_3007("-3007", "流水号格式不正确", "-300"),
    PARAM_WRONG_3008("-3008", "数据包格式不正确", "-300"),
    PARAM_WRONG_3009("-3009", "右侧照片，照片格式不正确", "-300"),
    PARAM_WRONG_3010("-3010", "右侧照片，照片文件太大", "-300"),
    PARAM_WRONG_3011("-3011", "左侧照片，照片格式不正确", "-300"),
    PARAM_WRONG_3012("-3012", "左侧照片，照片文件太大", "-300"),
    PARAM_WRONG_3013("-3013", "视频格式不正确", "-300"),
    PARAM_WRONG_3014("-3014", "视频太大", "-300"),
    PARAM_WRONG_3015("-3015", "打开视频文件失败", "-300"),
    PARAM_WRONG_3016("-3016", "空文件，获取不到视频帧", "-300"),
    PARAM_WRONG_3017("-3017", "有效帧为0", "-300"),
    PARAM_WRONG_3018("-3018", "有效帧数过少", "-300"),
    PARAM_WRONG_3019("-3019", "上传解码照失败，照片格式不正确", "-300"),
    PARAM_WRONG_3020("-3020", "上传照，照片文件太大", "-300"),
    PARAM_WRONG_3021("-3021", "入参格式有误，请检查", "-300"),
    PARAM_WRONG_3022("-3022", "银行卡号格式不正确", "-300"),
    PARAM_WRONG_3025("-3025", "照片类型不正确", "-300"),
    PARAM_WRONG_3026("-3026", "车牌号格式不正确", "-300"),
    PARAM_WRONG_3027("-3027", "受理凭证格式不正确", "-300"),
    PARAM_WRONG_3029("-3029", "证书申请受理失败,协议版本号错误", "-300"),
    PARAM_WRONG_3030("-3030", "证书申请受理失败,授权签名错误", "-300"),
    PARAM_WRONG_3031("-3031", "证书申请受理失败,授权签约流水号错误", "-300"),
    PARAM_WRONG_3032("-3032", "证书申请受理失败,哈希保存字段长度不能大于50", "-300"),
    PARAM_WRONG_3033("-3033", "证书申请受理失败，应用场景编码不存在", "-300"),
    PARAM_WRONG_3034("-3034", "证书申请受理失败，查询类型不存在", "-300"),

    AUTH_4001("-4001", "识别码不存在", "-400"),
    AUTH_4002("-4002", "MD5码校验失败", "-400"),
    AUTH_4003("-4003", "没有可用接口", "-400"),
    AUTH_4004("-4004", "超过限制数量", "-400"),
    AUTH_4005("-4005", "超出使用期限", "-400"),
    AUTH_4006("-4006", "超过今日限制数量，请明日再试", "-400"),
    AUTH_4007("-4007", "账户余额不足，请及时充值", "-400"),
    AUTH_4008("-4008", "接口QPS已达到上限", "-400"),
    AUTH_4009("-4009", "证书申请受理失败，未获取到用户授权", "-400"),
    AUTH_4010("-4010", "证书申请受理失败，用户授权签名验证失败", "-400"),
    AUTH_4011("-4011", "证书申请受理失败，应用场景编码不存在", "-400"),
    AUTH_4012("-4012", "证书申请受理失败，授权协议版本号不存在", "-400"),

    ERROR_5000("-5000", "服务器内部错误", "-500"),
    ERROR_5001("-5001", "服务器连接超时", "-500");

    /**
     * 二级返回码
     */
    private String code;

    /**
     * 二级返回码描述
     */
    private String msg;

    /**
     * 父返回码
     */
    private String parent;

    SubCodeEnum(String code, String msg, String parent) {
        this.code = code;
        this.msg = msg;
        this.parent = parent;
    }

    public String getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

    public String getParent() {
        return parent;
    }

}
